In [1]:
import pandas as pd
import numpy as np

In [14]:
scores = pd.DataFrame({
'Pepe': [10.5, 15, 10],
'Jose': [11, 4, 15.5],
'Gregorio': [22.1, 18, 18.1]}, 
columns=['Pepe', 'Jose', 'Gregorio'],
index=['22-06-22', '29-06-22', '06-07-22'])

scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 22-06-22 to 06-07-22
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pepe      3 non-null      float64
 1   Jose      3 non-null      float64
 2   Gregorio  3 non-null      float64
dtypes: float64(3)
memory usage: 96.0+ bytes

In [34]:
scores["Total"] = scores["Pepe"]+scores["Jose"]+scores["Gregorio"]
scores

          Pepe  Jose  Gregorio  Total
22-06-22  10.5  11.0      22.1   43.6
29-06-22  15.0   4.0      18.0   37.0
06-07-22  10.0  15.5      18.1   43.6

In [38]:
scores = scores.drop(columns=["Total"])
scores

          Pepe  Jose  Gregorio
22-06-22  10.5  11.0      22.1
29-06-22  15.0   4.0      18.0
06-07-22  10.0  15.5      18.1

In [39]:
scores.drop("22-06-22")

          Pepe  Jose  Gregorio
29-06-22  15.0   4.0      18.0
06-07-22  10.0  15.5      18.1